; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	GroundStation0 - direction
	Phenomenon1 - direction
	Star2 - direction
	Planet3 - direction
	Planet4 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet3)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Phenomenon1 spectrograph0)
	(have_image Star2 spectrograph0)
	(have_image Planet3 spectrograph0)
	(have_image Planet4 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation0 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon1)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon1 instrument0 spectrograph0)
   added: (have_image phenomenon1 spectrograph0)
   goals met: 1 of 5
6. (turn_to satellite0 planet3 phenomenon1)
   deleted: (pointing satellite0 phenomenon1)
   added: (pointing satellite0 planet3)
   goals met: 1 of 5
7. (take_image satellite0 planet3 instrument0 spectrograph0)
   added: (have_image planet3 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 planet4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet4)
   goals met: 2 of 5
9. (take_image satellite0 planet4 instrument0 spectrograph0)
   added: (have_image planet4 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   goals met: 4 of 5
11. (take_image satellite0 star2 instrument0 spectrograph0)
   added: (have_image star2 spectrograph0)
   goals met: 5 of 5
